app/views/home/index.html.haml

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
---
%h2 Questions Near You
- if @questions.blank?
  .message There are no questions :(
- else
  .questions
    - for question in @questions
      .question
        .question_content=link_to question.content, question_path(question)
        .question_location
          Near
          =question.location
        .num_answers
          =question.answers.count
          Answers
          %hr

#panel
  %input#address{:type => "textbox", :value => "Stanford, CA"}
  %input{:type => "submit", :value => "Go!", :onclick => "filterCodeAddress()"}
  %br

%br