app/controllers/home_controller.rb

  def index
    if user_signed_in?
      @questions = Question.all
---
SELECT "questions".* FROM "questions"